practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Taylor"], ["email", "Swift"], ["created_at", "2023-06-28 23:54:36.753690"], ["updated_at", "2023-06-28 23:54:36.753690"]]
---
  def create
    user = User.new(user_params)
    # replace the `user_attributes_here` with the actual attribute keys
    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    # Get an instance of a user
    user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "juliofoolio@gmail.com"], ["updated_at", "2023-06-29 00:05:03.270763"], ["id", 2]]
---
  def update
    user = User.find_by(id: params[:id])
    user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def delete
    user = User.find_by(id: params[:id])
    user.destroy